/*
 ******************************************************************
 *
 *  功能:     本程序主要是用于编写剧院座位表找到相应座位
 *
 *  文件名:   P6_8.cpp
 *
 *  作者 :    Yipeng Zhang
 *
 *  单位 :    河南大学计算机与信息工程学院
 *
 *  E-mail:   1262223614@qq.com
 *
 *  时间 :    2021年5月2日
 *
 *  版本 :    1.0
 *
 ******************************************************************
 */
#include<iostream>

using namespace std;

int main()
{
    int seat[9][10] = {
        {10,10,10,10,10,10,10,10,10,10},
        {10,10,10,10,10,10,10,10,10,10},
        {10,10,10,10,10,10,10,10,10,10},
        {10,10,20,20,20,20,20,20,10,10},
        {10,10,20,20,20,20,20,20,10,10},
        {10,10,20,20,20,20,20,20,10,10},
        {20,20,30,30,40,40,30,30,20,20},
        {20,30,30,40,50,50,40,30,30,20},
        {30,40,50,50,50,50,50,50,40,30},
    };
    cout << "请问您想要选择座位还是价格?" << endl;
    cout << "如果您想要选择座位，请输入1:" << endl;
    cout << "如果您想要选择价格，请输入2:" << endl;
    int input ;
    cin >> input;
    if(input == 1)
    {
        cout << "请问您想要第几排第几列的座位?" << endl;
        cout << "请分别输入排和列:"<< endl;
        int row, column;
        cin >> row >> column;
        cout << "您想要的座位的价格为:" << seat[row-1][column-1] << "元" << endl;
    }
    if(input == 2)
    {
        cout << "剧院座位的价格有10元，20元，30元，40元，50元。" << endl;
        cout << "请输入您的选择:" << endl;
        int price;
        cin >> price;
        cout << "您可选择的座位有:" << endl;
        for(int i = 0; i < 9; i++)
        {
            for(int j = 0; j < 10; j++)
            {
                if(seat[i][j] == price)
                    cout << seat[i][j] << endl;
            }
        }
    }
    return 0;
}

